app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."username" = 'juan')
---
  def login
    @username = session[:user]
    @password = session[:password]
    @User = User.find(:all, :conditions => {:username => 'juan'}).first