app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("active", "created", "created_at", "email", "is_staff", "last_login", "password", "updated_at", "username") VALUES ('t', '2011-12-26 19:03:22.000000', '2011-12-26 19:03:22.219922', 'juan.ca.rom@gmail.com', 't', NULL, '12345', '2011-12-26 19:03:22.219922', 'juan')
---
  def create
    @user = User.new(params[:user])
    @user.last_login = nil
    @user.created = DateTime.now